Revit 2027 API
Level.GetNearestLevelId(Document, Double) Method
 Returns id of the Level which is closest to the specified elevation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetNearestLevelId(
	Document document,
	double elevation
)
Public Shared Function GetNearestLevelId (
	document As Document,
	elevation As Double
) As ElementId
public:
static ElementId^ GetNearestLevelId(
	Document^ document,
	double elevation
)
static member GetNearestLevelId :
        document : Document *
        elevation : float -> ElementId
Parameters
document Document
 The document.
elevation Double
 Target Elevation.
Return Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The level can be at, above or below the target elevation. If there is more than one Level at the same distance from the elevation, the Level with the lowest Id will be returned.
See Also
Reference
Level Class
GetNearestLevelId Overload
Autodesk.Revit.DB Namespace